app/controllers/api/servers_controller.rb

  def index
    @user = User.includes(:servers).find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "servers".* FROM "servers" WHERE "servers"."id" IN ($1, $2, $3, $4)  [["id", 1], ["id", 2], ["id", 3], ["id", 4]]