app/controllers/api/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "DemoUser"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."username" = $1 AND "users"."id" != $2 LIMIT $3  [["username", "DemoUser"], ["id", 1], ["LIMIT", 1]]
---
    def create
        errors = []
        errors.concat(['username']) if params[:user][:username] == ""
        errors.concat(['password']) if params[:user][:password] == ""

        @user = User.find_by_credentials(params[:user][:username], params[:user][:password])

        if @user
            login!(@user)
            render :create
        elsif !errors.empty?