app/models/user.rb

  def reset_session_token
    self.update(session_token: self.class.generate_session_token)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "NN7TRr0xIIq1GlNgS944fQ"], ["updated_at", "2019-05-28 18:48:12.736929"], ["id", 1]]